[
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=f2f0bf1b1ebee0dd&fccid=f6a7f5efb7a3c587&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Developer (Entry Level)", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Azara Healthcare", "job_posting_desc": "Azara is seeking an entry level database engineer with a high attention to detail and a passion for creating high performing applications. You will work on designing, implementing and improving our data warehouse / business intelligence platform. This is an opportunity to be part of the healthcare industry’s rapid transformation as we work with our clients to identify and address real opportunities for improvement in cost and healthcare quality.\n\nThe team uses agile and test-driven development practices for new development as well as for refactoring and enhancing existing software. All work is done in a team setting with a focus on team accountability and success. Understanding the technical and business “why” behind team solutions is an important attribute of an Azara team member.\n\nDuties and Responsibilities\n\nDesign, developing and testing new features within our data warehouse\nCreate new interfaces to allow data to be securely transferred in and out of our system\nEvaluate new tools / frameworks to use within our platform\nParticipate in design and code reviews\nActively solicit and incorporate feedback from clients and internal stakeholders on new software features and designs\nRequired Technical Skills\n\nDatabase principles, processes, technologies, and tools (data modeling, design)\nExperience with databases and SQL\nWorking knowledge of a high level programming language (c#, Java)\nEffective written and verbal communication and presentation skills\nHigh comfort level interacting with colleagues and with various levels of client organizations\nStrong sense of customer service to consistently and effectively addresses customer needs\nAbility to deal with highly sensitive and confidential information and adhere to data security and confidentiality protocols and procedures\nEducation & Relevant Experience\n\nBS/BA in Computer science, information systems, or other technology/science degree\n1+ years’ experience in technology or technology related field\nAzara offers a full suite of medical plans, 401(k) plan, 10 company holidays, 4 weeks of paid vacation time and other benefits in addition to a competitive salary. If you are interested in applying for any of the Azara career opportunities, please send a cover letter and resume to careers@azarahealthcare.com."},
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=e29583c3ce11f784&fccid=51dc2e5aecda9e29&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Pluralsight", "job_posting_desc": "Job Description\n\nSoftware engineers on our team work closely with Machine Learning engineers to create a smarter, personalized learning journey for our users. You will be working on a cross-functional team with a Product Manager, UX Designer, DevOps Engineer, Machine Learning Engineers, and Software Engineers. You’ll be part of a team that is user focused, has a mentality for experimentation, and iterates quickly.\nWays we work:\nAutonomous & responsible teams - making their own product & dev choices (https://www.pluralsight.com/tech-blog/team-responsibilty)\nData first - we work with large volumes of data to build scalable solutions for our products\nSoftware Craftsmanship - we want to be proud of our work\nPair programming - we value collaborative developmentTest-driven development - we take responsibility for our code without QA engineers\nContinuous delivery - teams independently ship code to production every day\nKanban & Lean - no more backlog grooming, no more T-shirt size estimating\nContinual improvement - we hold weekly retrospectives in order to assess and improve system processes\nWhat we create with:\nBackend - Node.js/Python\nTesting - Mocha/Pytest\nDeclarative UI - React\nStyling - CSS Modules <3\nMessaging - RabbitMQ\nDatabase - PostgreSQL\nSource Control - Github\nFrameworks - Airflow/TensorFlow\nWorking at Pluralsight\nFounded in 2004 and trusted by Fortune 500 companies, Pluralsight is the technology learning platform organizations and individuals in 150+ countries count on to innovate faster and create progress for the world.\nAt Pluralsight, we believe everyone should have the opportunity to create progress through technology. That everyone should have access to the skills of tomorrow. That technology can make the world a better place. Through the work we do every day, we empower the people who power our world.\nAnd we don’t let fear, egos or drama distract us from our mission. Our mission to democratize technology skills is what drives us and our values are at the helm of how we work together. It’s our commitment to practicing them day in, day out that enables our performance. We’re adults, and we treat each other that way. We have the autonomy to do our jobs, transparency to eliminate office politics and trust each other to do the right thing. We thrive in an environment with creativity around every corner, challenges that keep us on our toes, and peers who inspire us to be the best we can be. We bring different viewpoints, backgrounds and experiences, and united by our mission, we are one.\nBe yourself. Pluralsight is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status.\n\nQualifications\n\nnull\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines."},
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=fa83a6a35f06173e&fccid=b25d11caf4595d18&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Engineering Intern", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Instart", "job_posting_desc": "Part-time, InternshipWe are looking for a full time or part time Software Engineering Intern to help test, design, and build the backend infrastructure and client-side components for Instart's large-scale mission-critical distributed system. If you are passionate about learning and working on cutting edge software technology together with a world-class engineering team, we want to talk to you.\n\nResponsibilities:\n\nDesign and develop code and scripts for client-side and server-side components of Instart distributed system, analytics data processing, and test infrastructure.\n\nQualifications:\n\nJunior or Senior year undergraduate student enrolled at a 4-year college program, or a graduate student, with major in one of the STEM fields, Computer Science preferred\nKnowledge of at least one programming languages (Java, JavaScript, Python, C, C++...)\nKnowledge of basic statistics, algebra and data visualization (graphs, charts )\nKnowledge of common algorithms and data structures\nBasic understanding of databases, some knowledge of SQL is helpful but not required\nFamiliar with command line utilities on Linux or Mac\nProficient with using Google docs and spreadsheets\nPassion to learn and work in a fast-paced environment\n\nAbout Instart:\nAt Instart, we are building a world where the largest brands in the world can deliver amazing digital experiences to their customers.\n\nEvery major brand today, whether it is online shopping, travel or media, is making huge investments to improve their online experiences to keep up with consumer expectations. As consumers in a digital world, we tend to abandon websites very quickly if the experience is not as good as we expect it to be - fast, engaging, and responsive. With 100+ patents using artificial intelligence and machine learning, Instart’s unique technology continually optimizes the online consumer experience, learning from every interaction across devices and networks.\n\nWe’re growing at a rapid pace - on the path to increase our revenue and customer base by 4x in the next couple of years! You have an opportunity to be a part of this amazing growth, working on cutting-edge AI/ML cloud technology with some of the greatest minds, to help the most recognizable brands in the world create better digital experiences.\n\nInstart is backed by major investors who are all looking to see us become the next Unicorn and more – Andreessen Horowitz, Kleiner Perkins, Greylock, Wing, and Sutter Hill to name a few. We take pride in the great experience we offer our employees from our flexible work schedules to free lunches and our super cool, dog-friendly office in Palo Alto. Let’s talk about your next career opportunity at Instart.\n\nInstart is an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AVKLlbEkauwKsD17hdtxxIbnLa1Bh8fW274UzALlWLiESOMUfCO4J6_C4YN5qbxSwhHi9jkYoOqKAcJOerHm41Qyip-iP-Vus40ig7jK-vKJlT73ngKwPXyiDRjFNTzKu5FEhtCU2FtqoP64P6sG6O_pm8WzOzwFMCAy1t7IOsGS-BYvcwO2D45jAm7RSvYDYGVRbnFtPS-vzU3dmy-j0dImK-j1hnSfz6JhnumHjp4_Ixq5YREt6xfFcXc0asKjEYfSQZ7Twyd9nCh7wcwmRZxK-yiIyn03sHEgzYtwATFMIZG-z_j0O9u1Ws0IRqP9qwSN3H9Cqjf-hzN15amM5-FgPs8US2vJUsmLOtgPEhOo760u46nWGlQxm-wo8N_QKZP2i6jwdMTpISqJNre3pMMppiS64w1yevGbhHHA3KX204HAt3tbkuPLYevEntTfBuUEMK-EWJmr-QrvlqTE2j8sDBZJh27t090Y56y3HClGiLpyy8S4Ci&vjs=3&p=1&sk=&fvj=0", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Homesite Insurance", "job_posting_desc": "Homesite Insurance was founded in 1997 and was one of the first companies to enable customers to purchase home insurance directly online, during a single visit. Since then, we've continued to innovate rapidly to meet the needs of our customers and their changing expectations.\nOne thing that's stayed the same since our founding: our commitment to our customers, partners and employees.\nJoin us on our journey as we continue to grow into a powerful contender in the field of insurance.\nHomesite is always seeking new Software Engineers to work closely with various IT Teams, with a focus on supporting services, supporting business logic for our front end applications and supporting internal systems. As a member of IT Development Team, this person will primarily be designing and developing services that support our ecosystem of homeowner’s products. The ideal candidate has a strong programming experience and has worked with modern technology stack including micro-services architecture and test-driven development methodologies in a fast-paced agile environment.\nDUTIES AND RESPONSIBILITIES:\n\nSupport and update existing internal applications and services.\nCollaborate in our Agile/Scrum software development process.\nWork with product stakeholders to establish software requirements.\nWork with platform & system architects on software and system optimizations & enhancements to create elegant designs.\nWork with other software leads on developing and improving software development methodologies and processes.\nFocus on design patterns, test driven development, enforce code quality and standards, and document APIs.\nLead & guide the fellow developers on the team through technical skill development and knowledge sharing.\nAlign technical solutions with business and IT strategic visions while complying with the organization's architectural standards.\nCollaborate with Project Managers, business and technical analysts, developers, QA, and other IT team members to understand business & technical requirements that drive the analysis, design, and creation of quality technical solutions.\n\nKNOWLEDGE, SKILLS AND COMPETENCIES:\n\nA firm knowledge of Java and related tools such as Spring Framework, Spring Boot, Maven\nA firm knowledge of C# and .Net Framework.\nHands on experience using and developing REST APIs using micro services architecture\nWorking knowledge of distributed enterprise architecture.\nStrong understanding of Git, Bitbucket, Jira, Confluence, Swagger (API documentation).\nWorking knowledge of relational databases such as MS SQL Server, MySQL and Aurora\nWorking knowledge of Agile / Scrum methodology.\nAbility to visualize, articulate, and solve problems to make informed decisions as well as organize and analyze a solution as part of a whole and its individual components.\nAbility to communicate effectively in written and oral communications.\nRespond well to change; handle multiple demands / priorities effectively; adapt to best fit with situation at hand; handle conflict effectively; willing to accept new responsibilities; take initiative and be accountable.\n\nEDUCATIONAL QUALIFICATIONS/JOB EXPERIENCE REQUIREMENTS:\n\nBachelor’s degree in Computer Science, Computer Engineering, Information Technology/Systems, related field, or equivalent experience.\n4 + years of relevant experience around design and development of distributed enterprise applications.\n\nOTHER JOB EXPERIENCES DESIRED:\n\nInsurance industry experience a plus, but not required.\nExperience with cloud computing APIs (Amazon Web Services preferred).\nExperience with cloud computing services (Amazon Web Services like Lambda, S3, CloudWatch, ECS, and RDS preferred)\nInterest in emerging platform-as-a-service / distributed application frameworks such as ECS, Spring, ElasticBeanstalk and Docker.\nPrior experience of Microsoft Stack of technologies.\nApply to: careers@homesite.com"},
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=956747ad9404ae6d&fccid=fe2d21eef233e94a&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Development Engineer Intern - Amazon Robotics Summer 2019", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Amazon Robotics LLC", "job_posting_desc": "Temporary, InternshipSense of humor and willingness to learnAbility to collaborate effectively with a diverse, talented teamCompletion of at least junior year of degree program is requiredDegree program in computer science, electrical engineering, applied math or other algorithmic-centric disciplineGPA of 3.3 or higher\n\nAre you inspired by invention? Is problem solving through teamwork in your DNA? Do you like the idea of seeing how your work impacts the bigger picture? Answer yes to any of these and you’ll fit right in here at Amazon Robotics. We are a smart team of doers that work passionately to apply cutting edge advances in robotics and software to solve real-world challenges that will transform our customers’ experiences in ways we can’t even imagine yet. We invent new improvements every day. We are Amazon Robotics and we will give you the tools and support you need to invent with us in ways that are rewarding, fulfilling and fun.\n\nAmazon Robotics is seeking talented and motivated interns to design, develop and test software that controls and optimizes mobile-robotic fulfillment systems used by Amazon.com operations. Amazon Robotics software is developed using agile methodologies in a collaborative team environment. Amazon Robotics software facilitates user workflows, robotic control and machine to user interfaces, advanced algorithms and mobile technology. Ideal candidates will be enrolled in an undergraduate or graduate program related to software development/engineering. This position will report to the Amazon Robotics functional manager most closely aligned with the candidate’s skillset and project work. Each intern will have an assigned technical mentor throughout the internship, as well as 1-1 guidance from their manager, and will work closely with other engineers.\n\nThe Intern will be responsible for:\n\nIdentifying and developing software solutions to current business problemsCreating milestones and deliverables and tracking status with teamParticipating in daily scrums and reviews with development teamsDeveloping design documentation and leading reviews with other interns and engineersWriting code and unit tests and integrating code with other software and hardware componentsUtilizing Amazon Robotics and Amazon engineering tools, processes and technologiesPrototyping and testing concepts or features, both through simulation tools and emulators and with live robotic equipmentDelivering a final presentation to managers and engineers on the successes and challenges of their internship and the business value they have contributed\n\n\nExperience with creative problem solving and getting things done\n\nProficient oral and written communication skills"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CbeI6XyAq_KWD_21xxPMwBoUgEea5xSoXeoxx5nebNxbweym3SduMpxCq53o4Ojaiyq1str96S9Bw2LTlLTQXtoL3pjL5Ee_8MK4m_G2tWb8sSQl_W1lc43F5b-mRFPYaSqK8GiKkeJCkbYgebv-1A58UTPrMLknEvKwncimEZTjfjncLG2x4E-NLQlWa0kFCsxypaEgCA4-fTCIul-mKeRFW9nnOGKgAMucWaq6cFmmdaZrMr3H0S4aG6t1zDYDJ5Z9etvrKfGZbXProw5sPSVEDNc-TqGRccf8nd4dZGQWhBcUOl2O9ppO9_1VS_SfVBnYgt88UhxMYpWvllS0-4lpbOYwIUcJPfJ0umw7Z4EdDbhDQpFF-oFoUL9kbGdDVITArRDNKnkrd2Hq-YgRA5mjrMeMr-vLLGCKFqDQj-5nE3vQmOhJMSTCZYS0UMbO8meuBaFvgI0w==&vjs=3&p=6&sk=&fvj=1", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Macintosh & iOS onsite Systems Engineer", "job_posting_salary": "$63,000 - $70,000 a year", "scrap_date": "28-03-2019", "company": "Call Andy! Macintosh Consulting", "job_posting_desc": "$63,000 - $70,000 a yearWhat we're looking for: Call Andy! Macintosh Consulting has an immediate need for a full-time onsite Systems Engineer supporting our focus in mostly Mac-based Micro/Small Business and high-end residential clients. This is a long-term career opportunity for an experienced, and customer service-oriented engineer who loves being a bridge between technology and end-users. We need you to be an excellent communicator, energetic, enthusiastic, self-motivated, and possess a proactive attitude. Ideally, the right candidate will have experience with Jamf, Synology & Cisco Meraki as well as Apple support certifications, and have 5+ years of Mac support in a professional setting.Our goal to move our clients’ use of technologies and workflows forward to help them achieve their goals. Our strength is our ability to “see over the hill” for them. As an onsite Systems Engineer, you will be a technology advocate, both supporting and educating our clients, as well as assisting other Call Andy! engineers with project implementations. You will be responsible for the hardware and labor budgets for individual projects, working with our Manager of Finance and Admin to author Statements of Work, and drive the implementation of assigned projects across our client base. The position requires a mix of hard and soft skills: an instinct for thinking several steps ahead, communicating technology impact and needs with our clients in business-centric language, but also an innate desire to bring order to chaos and a knack for working with people across all levels, from end-users to CEOs, in a wide range of industries. You will leverage your experience to set stakeholder expectations, ensure projects meet both our standards and our clients’ definition of success, communicate the business value of the results, and drive iterative and on-going efforts to successfully complete the project on time and on budget.This role is semi-autonomous, where your home is your base, and you drive daily to different clients in your Call Andy! portfolio. Your role is to be the primary face of Call Andy! with those clients and essentially be their IT department.Services include troubleshooting, maintenance, upgrades, networking, and training/consulting for clients in their homes or places of business.You’ll be responsible for coordinatingand working to resolve issues with the diverse aspects of their IT needs for which we’re responsible. This relates to all technology, vendor specific hardware and software, and client-specific workflows.You will need to have an appropriate home workspace and a reliable broadband internet connection, as well as a dependable vehicle to get to daily appointments. We communicate with each other throughout the day via phone and Slack, as well as in-person monthly team meetings and other events.Interested?Please visit https://www.callandy.com/engineerscreen, complete the questionnaire and submit your resume.In this role, you will: Provide day-to-day support in primarily Mac and cross-platform environments for desktop, server, network, NAS, and cloud systems.Respond and work to resolve Call Andy! client service requests from email, in person, and remotely.Identify opportunities for the implementation of new technology within each client’s workflow & IT environment.Identify, research, and resolve complex technical problems related to systems and workflows.Design and implement server, network, and cloud solutions.Research and write technical documentation related to processes, vendors, quotes, how-tos, internal and external KB articles.Send notifications to clients related to technical issues, equipment and software upgrades, malware, and other news related to Mac environments.Document, track, and monitor issues to ensure efficient and timely resolutions.Document and track your time and expenses in ConnectWise.Additional Duties and Responsibilities: Provide exceptional customer service and support for a wide variety of equipment.Develop a working understanding of organization’s key services for which support is being provided.Strive to improve customer service, perception, and satisfaction.Manage client expectations skillfully.Respond to and turnaround customer requests quickly and efficiently.Provide real-time ticket updates in ConnectWise.Document client configurations, work sessions and other notes in ConnectWise clearly and concisely.Meet or exceed quality and service level goals.Knowledge, Skills, and/or Abilities Required: Proficiency in macOS and iOS operating systems, business applications, printing systems, and network systems.Proficiency in MDM & RMM solutions such as Jamf, Watchman Monitoring, etc.Masteryof support tools, techniques, and how technology is used to provide services.Ability to see the big picture of systems and workflows.Ability to work in a team and communicate effectively.Must enjoy working semi-autonomously.Self-motivated, with the ability to prioritize, multitask, and quickly adapt to changes in an environment with multiple competing tasks and responsibilities with minimal supervisionAbility and desire to build and maintain great relationships with clients.Excellent phone etiquette, listening, written and verbal communication skillsMust excel in self time management and organizational skills.A great sense of humor is appreciated.What you bring to the table: A think-ahead, “ounce-of-prevention” mind-set.Bachelor's degree from an accredited college or university with a major in computer science, information technology, business administration, or a related field (or equivalent experience); MSP experience is a big plus.Experience supporting and maintaining professional grade firewalls and VPNs (Cisco Meraki, SonicWALL, Watchguard, etc.), WAPs and managed switches.5+ years of Mac-related IT and networking experience (and this means you’ve assisted with more than the deployment of a few routers, switches and wireless access points).Advanced understanding of troubleshooting macOS and iOSBasic understanding of network and internet protocols such as DHCP, DNS, MX Records as they pertain to troubleshooting client-side issues.Working understanding of AV & automation systems such as Sonos, Nest, etc.Apple Certifications not required initially, but preference will be given to certified applicantsPositive and collaborative attitude that demonstrates initiative and tenacityInformed of technology trends, an insatiable desire to learn new things, follow best practices.Must be able to lift at least 50 lbs.Must know which end of the drill you are supposed to hold.Monday-Friday 9am - 6pmMust be willing to work outside normal business hours when necessary (on-call support)Must have appropriate home workspace and a broadband internet connectionMust have a reliable car, a clean driving record, and a valid MA driver’s license with current insurance.Must live within a 30-45 minute drive of downtown BostonMust provide 3-5 professional referencesMust be able to pass background, CORI, and credit checksMust be legally able to work in the USWhat we offer: Competitive salary based on experience and qualificationsHealth benefitsMac laptop, iPhone (if needed) and other toolsPerformance-based incentivesGenerous bonus levelsSimple IRA with matchingFull on-the-job training & supportFun working environment and cultureTraining and great opportunity for advancementOpportunity to learn new things on a daily basis, collaborate and cross-train with our other engineers and vendorsOpportunities to present at industry eventsInterested?Please visit https://www.callandy.com/engineerscreen, complete the questionnaire and submit your resume. This is our own process to make sure that we are talking with legitimate candidates and can get an early understanding of your skill set.Share your resume and a cover letter that explains why you believe you’d be a fit for Call Andy! and this position. Impeccable communication skills are essential to all we do, and we weigh cover letters heavily. We love a cover letter that shows us your personality, but don’t stress if you’re not a comedian. Just be yourself. We’re mostly interested in learning who you are, what you love to do, and why you’d love to do it here with us. And if you send us the generic one you send everyone else, we’ll be bummed.About us: Call Andy! Macintosh Consulting is a 20+ year old Mac-centric IT consulting company based in Wayland, MA. We have terrific long-term clients across a wide spectrum of micro & small business, SOHO, and high-end residential clients in both break-fix, and managed services models. Through collaborative, long-term relationships with our clients, we help them to maximize the return on their IT investment, sustaining measurable results with an eye on business strategy, practicality, pragmatism, transparency, a heap of creative problem-solving, and a sense of humor. We may be geeks, but we are geeks with social skills. We love learning new things and our skills and projects are continuously growing in scope and breadth.We provide a career path in IT Consulting that you can’t find elsewhere. You can come to us as a “first job in consulting” and we’ll provide you with experience, training, and mentoring to become a senior IT professional. Or you can come to us as a senior IT consultant and work with the most amazing and experienced team of senior talent who help each other (and push each other) to grow. Best of all, you’re in a position to impact the direction and growth of this company. Ultimately, we want to create a work environment that you’ll want to retire from after a long and fulfilling career. We focus on work/life balance, a supportive team environment, an ethical approach to business, and an emphasis on the long-term relationships we build with our clients.Job Type: Full-timeSalary: $63,000.00 to $70,000.00 /yearExperience:Mac support: 5 years (Preferred)Education:Bachelor's (Preferred)Location:Boston, MA (Preferred)License:Driver's License (Required)Language:English (Required)Work authorization:United States (Required)Benefits offered:Paid time offHealth insuranceRetirement benefits or accountsEducation assistance or tuition reimbursementCommuting/travel assistanceFlexible schedulesWorkplace perks such as food/coffee and flexible work schedulesOthers"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CgsfMtVtRReqlY5EjWEH3NGae5gzjDwBE_fdOSrakDuR_BBN0wKfXwRyEEDEB5osVDbHpiWXO277RX2uLFrw10JtRbkI1yMNR7jMxBvPt_g8Wf85KTmmaTvC_qWsh4PQ-A2Ozn3OLZO7ZjRF_SUJFNRfiJz45OrFjs5Kc7mVbFgHxDvoqw5p7XBHdCPFzg4qX9by9_4THE46GzNQBof1Vu5x6EIi6YF8GJjiFQNT6P_k--XnzaVQFe9zlWi2KJaZGyFkDPl2nmxTf4WW-1CSGn4PJkUdNPWDNrVr_yXZe-8ScztveXWJbX7NdUH7TE2jymPplfGPnPv9kcBRynPUWe1nm6s0P9uBuSF8uq0JqfCUYRHpEnl_HGNQliLSqH8jK9ENVMe8espWScyTkkvNbKL5HF8R11SnJicTb9bcX-yRk7AkO0EFMhyJEimD4y-lI=&vjs=3&p=2&sk=&fvj=0", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Support Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Snowbound Software Corporation", "job_posting_desc": "We take support very seriously at Snowbound so we are looking for someone who is comfortable with Support as a career. We are not looking for someone who will just answer phones and read from a script. We want someone who will commit to providing our customers with top notch, customized support.\n\nThis Support person will be responsible for responding to support requests for Snowbound’s viewing and imaging software products.\n\nThis involves:\nProviding professional responses to the customer through our ticketing system.\nReproducing issues in our VirtualViewer® and RasterMaster® SDK products. This requires skills in:\nInstalling and configuring multiple versions of multiple products on Windows and UNIX.\nUnderstanding basic differences between many document formats, including pdf, doc, docx, tif, jpeg and others.\nReading between the lines to reproduce behavior when the customer has not provided all the information needed.\nCustomizing web application configurations in XML, CSS, and HTML.\nProgramming in Java or C#.\nKeeping concise updates of support issue progress in our ticketing and bug tracking system.\nPrioritizing incoming requests based on severity of the issue and the level of support the customer is entitled to.\nBeing organized with attention to detail to ensure the correct products and options are delivered to the correct people.\nFluency in English is required. A Bachelor’s degree in a technical field is a plus.\n\n\nIn order to fit into the Snowbound culture the person must have a positive can-do attitude, must work well in a team, and be a self-starter with a good understanding of priorities.\n\n\nWe strive to make every position at Snowbound Software rewarding and fulfilling. You will have the opportunity to grow your knowledge, capabilities, and responsibilities in a variety of directions. Compensation is commensurate with experience.\n\n\nBenefits:\nVacation Days – 3 weeks accrued in first year + bonus time on anniversary\nSick/Personal Days – 2 weeks per year + 3 floating holidays\n401k plan\nHealth, Dental, Vision, Life, and Disability insurance\nEducation and training reimbursement\nDiscretionary profit share/bonus plan"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0B_ic_lyYdB92l-47iK7M2O-Cx2i-GLy_ImdN3yuA5nHl2bZBpVCXodzvOkFPjPeIVJvMVSN6zny-qew7e1h27gFuw96OKaao2WeFLeqBqQf7sin9xrlHnwpC6UfceqvjP0Whr-hkPr8zLHmO9LjXWrUhMwhu7jgyqMAcchm_OqYOTqiQEbACq2x6uxJgQrh3eX67A8NbIfe-EHDReBP6ZXUwnhyN6RxvsmZ1dEzBpBB8cXMqkuaaKBd_o0_pEb_1mTBzLBfSJNKLekMh3n1L5zYIZcOaKfw1iyM64Wxp7jlPCLFO2KnEc8pFsoEWQ7OjlYZrNv6bN0Fte74sdAGbXPH1o9yqmq-sFXF8GlpBrMo695pEo1QJppbtQkO52NqD0wJ6VMd6fR2ZUbb4TMbUSDbTefjpMZNpqnWLVNnUvxm1I_Xc3_cjRjKsLwhh1oySmCacQ7nv-jfRScWsTPRpbp8Tx_tqtzxUoYc5hZhmkd0sZV_VzhyzBBNU2Yhas_RJUwDzF9ue1rR1zbBeDhWeRsgv05pQ55_jl1B5t2hPhBcPepp4v8Ia06&vjs=3&p=4&sk=&fvj=0", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Philips", "job_posting_desc": "Job Title\nSoftware Engineer\nJob Description\nIn this role, you have the opportunity to\n\nWork with the HealthSuite Digital Platform Support Operations team who is currently seeking a talented web tools back-end developer. You will get experience with developing for multiple customer channels, as well as various tools and applications on a common cloud platform. This includes management, design, implementation and advocacy of the revenue cycle management system. The successful candidate must have extensive experience in Python and Web development, integrate with backend systems and new digital product offerings, and lead and set coding standards/ development tools/test tools for future development of HSDP-enabled products.\n\nYou are responsible for\n\nWork on a variety of projects as a part of a scrum team building web-based applications, database-backed websites and apps\nParticipate in architecture design processes to meet end user requirements.\nReview, analyze and modify systems, including documenting, designing, developing, testing, troubleshooting, repairing, monitoring, and maintaining.\nInstall or customize modules and features for open source and proprietary software packages.\nAssess new standards, technologies and trends, and formulate strategies and plans for future service tools and products.\nParticipate in review and staff meetings.\nYou are a part of\n\nHealthSuite Digital Platform Support Operations team. The group is a small, agile based, empowered team that is responsible for the support of tools and products that support multiple business solutions. Team oriented environment.\n\nTo succeed in this role, you should have the following skills and experience\n\nPython, Microservices, PHP, MySQL or other DBMS, MVC, UI, B2C Web Development, HTML, AJAX, JSON, UNIX\nPrior experience with cloud architecture preferred\nCS Degree highly preferred\nExperience with build management tools a plus\nAbility to work independently and as a member of a team\nStrong interpersonal and communication skills, including the ability to work effectively with diverse groups\nRelentless desire to learn and teach while adapting to evolving expectations and requirements\nKnowledge and understanding of current authoring languages and standards, editing and authoring tools, and related website technologies\nUS work authorization is a precondition of employment. The company will not consider candidates who require sponsorship for a work-authorized visa.\nCompany relocation benefits will not be provided for this position. Candidates need to live within the territory or within commuting distance to this location.\nIn return, we offer you\n\nSharpen your talents with new challenges in our dynamic organization. As a market-driven company, we’re used to listening to our customers & apply the same thinking to our employees. We offer a competitive salary, outstanding benefits and flexibility in a career with a positive and supportive atmosphere in which to develop your talents further.\n\nWhy should you join Philips?\n\nWorking at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.\n\nTo find out more about what it’s like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog. Once there, you can also learn about our recruitment process, or find answers to some of the frequently asked questions.\n\nPhilips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.\n\nAs an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.\n\nContact\nIf you forgot your password, you can click the Forgot Password button on the Sign In screen to reset it. In case of technical difficulties, please send an email to careersite@philips.com.\n(Note: To ensure fairness and legal compliance in our recruitment processes, only technical issues will be monitored through the above inbox. Please do not submit resumes or applications to this email, as they will not be reviewed. Only applications received through the online application process will be considered.)"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0BorENGkQ-q4dQLUzs_NciaZwWsXyipAmGUW3FM0NIyl5LYeO0JWuwzAlaGlILQ9IZzT0fc2U5F5ca8-S5-Hp5XYXNqKZfMCsWHXI-TXy8HrVkJ5Oj2EuVMj4VfSEs_57hjLWafO47JP5GQPZocK8v72id9vQnSckx4JP4e83hz1EoCRPaXGumSnbDvYRmLV28CeOmrPdosWLt49oOIKYMFbWIBhlxrRfNUfqQdeOArxBC6Y5I43uPTJQrBCLtKzXVCIYD-riusritR95a_t2lajBvIJBu7bgJEQeS_f5gKLiGR6NEVYiwfPoN3RDmcr8UBEfd_mgZOZFPMfjLXvFPXwzeBfyO-z8l5fRLKfxhSeNLhUjWnPZBzlkixgjuHtS4lxdwg51Nxj_kxNBK1xKcI7hcIpuEydAzjRC44M9ZLdmcsfQGMVkNw6ELes6QHacGGJudM8N7rxQ==&vjs=3&p=8&sk=&fvj=1", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Senior Software Engineer (Relocation to New York City area)", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Bridgewater Associates", "job_posting_desc": "We're looking for people who can be the leaders of the company — starting on their very first day.Bridgewater manages global investments for a wide array of institutional clients, including foreign governments and central banks, corporate and public pension funds, university endowments and charitable foundations.Role SummaryThe Sr. Software Engineer is a hands-on engineering role focused on designing and building architectures, platforms, and standards to model the world’s economic markets.What we offerHighly competitive compensation packageRelocation PackageMedical Benefits/Premiums covered 100% by the companyUp to $15,000 401k Match AnnuallyFree Lunch/Full Pantry ServiceGym Membership onsitePosition RequirementsStrong computer science fundamentals with a mastery of backend platform-level development.8-10+ years professional software development experience in technically rigorous environments holding extremely high bars for their engineers.Experience with extremely complex backend systems and a fluency with contemporary programming languages, patters, and architectures.Programming experience with Scala is a plus, but not required. We are not a language-specific shop; however, the majority of new backend technologies are built in Scala.We think you’ll click with us if youAct like an owner consistently holding a high bar for the quality of your code and are passionate about doing things the “right way.”Anticipate problems and complications, and formulate solutions to unblock the progress of the project.Can react to a mission critical problem in an excellent way, and not sacrificing quality over speed.Are open-minded, appreciate direct feedback, and revel in intellectually rigorous environments.You’ll Spend Your TimeEngineering extremely sophisticated tools and collaborating with some of Bridgewater’s most sophisticated investors within our Research department.Building the next generation research platforms focused mostly on data: ingestion, storage, visualization, or simulation (team placement within the research department based on your skills and affinity).Mentoring more junior engineers and taking responsibility for developing your team.Job Type: Full-time"},
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=91f927479adcde9e&fccid=f7029f63fe5c906e&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Engineer I", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Verizon", "job_posting_desc": "What you’ll be doing...\nThe SW Engineer I, Technology, is a responsible for helping with implementation and integration of software modules for 5G and Mobile Edge Compute (MEC) proof of concepts.\nUnder the direction of senior team members, the Engineer is assigned concrete tasks in the context of sprint planning and execution. Engineer is expected to diligently manage and update assigned JIRA tasks in sync with progress and deliverables. He/She is expected to be an active participant at Sprint planning and reviews.\nPrimary Responsibilities include:\nHelp with implementation and integration of SW modules for 5G and MEC proof of concepts. Familiar with cloud infrastructure offerings. Code reviews. Collaboration with integration team to define test criteria and execute tests. Analysis and interpretation of test results.\nIndividual must be highly knowledgeable of the current software technology trends. You must have a background in software development and integration. You have experience using Scum/Agile design practices and tools.\nWhat we’re looking for...\nYou’ll need to have:\nBachelor’s degree or four or more years of work experience.\nFour or more years of relevant work experience.\nEven better if you have:\n2+ years relevant experience\nComputer Science degree\nProficient with Scrum/Agile development design practices and tools\nB.S. Computer Science or equivalent\nExcellent verbal and written communications skills\n2+ Years SW development experience\nExcellent written and oral communication and presentation skills to convey complex technical concepts to peers.\nComfortable with embedded C programming, C++ application programming, REST API\nAPI development in Go or C++\nComfortable with Build and Release tools such as Git/Github/Gerrit, Jenkins\nTools: JIRA, Confluence, MS Office / GSuite, Git/GitHub/Gerrit, Jenkins\nWhen you join Verizon...\nYou’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.\nEqual Employment Opportunity\nWe're proud to be an equal opportunity employer- and celebrate our employees' differences,including race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, and Veteran status. Different makes us better."},
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=179c7177bccb4baf&fccid=42f1e4ca72488e15&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Embedded Software Development Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Bose", "job_posting_desc": "As an embedded software engineer in the Aviation and Military group at Bose, you will be responsible for developing and supporting software as part of cross functional project teams, providing the expertise to leverage and implement software to create products that are robust and intuitive to use. While the team’s focus is on embedded Bluetooth® products, team members are often required to wear multiple hats, with opportunities to work on build infrastructure, PC applications, Matlab-based tools, mobile apps and other special projects as needs arise.\n\nThis position is a great opportunity for a self-starter who wants to have a big impact not only on the future of our products, but also on how we can develop software more effectively.\nKey responsibilities of this position are to:\n1. Design, implement and deploy embedded software for new headphone products that include technologies like Bluetooth®.\n2. Contribute to all phases of the software lifecycle, including requirements analysis, design, implementation, test coordination, release, support, and documentation.\n3. Identify, coordinate and work with software development and support groups across the corporation as appropriate.\n4. Evaluate and work with 3rd party software providers as appropriate.\n5. Occasional travel may be required to support interoperability test events, meetings with 3rd party suppliers or prototype builds.\nThe ideal candidate will have many of the skill sets described below:\nExperience with C in an embedded environment.\nExperience with Python programming and shell scripting\nGood fundamental software development skills: working with APIs, leveraging existing code, developing modular, reusable code\nExperience programming standard microcontroller cores (e.g. ARM, MIPS, PIC)\nStrong troubleshooting and root cause analysis skills.\nPassion for consumer electronics and a desire to take an active part in shaping the user experience.\nExperience with networking protocols such as Bluetooth®, and serial communication protocols like SPI, I2C, RS-232, etc.\nWorking knowledge of electrical design schematics analysis/interpretation.\nExpertise with basic lab equipment (oscilloscopes, power supplies, multimeters, etc.), as well as knowledge and exposure to basic hardware design.\nExperience programming and debugging in real-time systems.\nExperience with version control, bug tracking systems and software documentation.\nDemonstrated ability to work on teams and a desire to learn from others.\nStrong spoken and written communication skills, including ability to produce clear and concise technical software documentation.\nEducation/experience:\nBS in SW engineering, Electrical Engineering or Computer Science with a minimum of 5 years related work experience.\nBose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information."},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Aousd15sYXrhf4YXk14MwJxuY1ivfOO-TlskXG7y3ogRK1E6a0YYveDFqA4Gcx3kbXiov8EOs5yFXrzjZ7d0TOx-cDH4tipYTC_PiyVVjNL305DFGEipvZ_h4I4X0XN3hWn_RDN1DKif2TWZDNtV9V2mdI0o_wxrxU1PnCWdRjPDz1WM0gUPSMAGWNNOQ2FeRoS-IWbDq6ua-yTj59hZ9-2gu8svb3YlubGKaeMqMtbtvS7Wk9ScCjf6LCF6-dkCn1zlwfekmDuwMREygH7ptFbI7FN8ETZ2dw33rtMQTxJGgyJVsBub5gT0_Iz_jHPOcWPYoIdHbPYIIHrP9fz54Uz4Cl4sEx-I7idLyp7g1LwTqZ65urihNl480MZFXgGPIt34aJZALUIyl0GVYqIOZtwodDJmmjccq8jYIbax-2d4Kp8PsjiHJXafM6Qc8JCi829Xo2OVFFcyJ8V2f1cNqF&vjs=3&p=9&sk=&fvj=1", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Configuration Management Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "RL Controls, LLC", "job_posting_desc": "Job Description:  Configuration Management EngineerCompany: RL Controls, LLCLocation: Boston, MAEducation: Bachelor’s degree in a Technical FieldJob type: Full-timeResponsibilities: -Perform Configuration Management related functionsPlanningConfiguration IdentificationStatus AccountingConfiguration ControlAudits-Develop project specific Configuration Management Plans taking into account industry standards, ASTS processes and the project contract-Ensure the implementation of project specific Configuration Management Plans-Perform Physical Configuration Audits, facilitate root cause analysis and corrective and preventive action implementation-Report information needed for configuration management such as the status of configuration items (CIs), proposed changes and the implementation status of approved changes-Provide Teamcenter and DOORS support as requiredSkills and Knowledge: -Bachelor’s Degree in technical related field-Highly motivated with excellent problem solving and documentation skills and the ability to work independently-Prior experience conducting Quality or Configuration Management Audit a plus-Prior experience in a software development environment a plus-Experience with CMMI a plus-Strong working knowledge or experience with Teamcenter (or another PDM system), DOORS and Rational Team Concert a plusPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.LOCAL CANDIDATES ONLY.RLC is an EEO Employer and will offer a competitive salary with benefits including health-dental-vision-life insurance, personal time-off, holidays, 401(k) to qualified candidate.Job Type: Full-timeExperience:Teamcenter: 3 years (Required)conducting Quality or Configuration Management Audit: 2 years (Preferred)Education:Bachelor's (Required)Location:Boston, MA (Preferred)Language:English (Required)Work authorization:United States (Required)Benefits offered:Paid time offHealth insuranceDental insuranceOther types of insuranceRetirement benefits or accounts"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D4CCI6NNsDXxT6UkWgE1mBPhnzs0fYXDbFunDf5KU2kSiFBYKKdFoFrOWUArrKJydkjyXFzfxjhSucLOsH6XotluFfp6-u9xriWgPOu0HROafagW0CkRxnkdI4pZRDZUYd8DyM6Als0t7QxsdDTT9NYztZVtp7IedkMU8B5hLtYf0iXkyalFWgve0ckHS3QFy431cDJOoHaVzG7D9MTGQJVs2SE7pJ2pGsrqv8h5wgyDzzTqGkBKFvVL1O0PZbCe3HcaGIjppOn2VdzbYE4vF8GOCGbGZ46UxcOF8W3hd7tTlUO0ICAKt8idMpfAbQmCAjZoEFi33tCI2sxb2wtFZ9dIVrLOr-1Pf9fv9ZmQxthZH2APav373RzB_5Bi_2Wmw0seS1dPPX32VcJwmnmiLSzKhu_7n8zEZ2kvQ3aNjtmhusF1CATVZmQ2uqh2Z0_N5pMo6BXS_sIbNO6YxvGI_M&vjs=3&p=5&sk=&fvj=0", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Technical Support Engineer (m/f/d)", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "baramundi software AG", "job_posting_desc": "Shape your future with us!\nAs the publisher of the “baramundi Management Suite” product, baramundi software AG, based in Augsburg, Germany, is a leading provider of endpoint management software. Innovative product development and a comprehensive range of services is what sets us apart. Due to our rapid and continual growth, in 2017 we established a subsidiary in Boston Framingham USA.\nIf you are interested in new, challenging opportunities, being part of a qualified team and working in a dynamic and professional environment, we’d like to talk to you. For our subsidiary in the USA, we are looking for an outstanding individual to start as soon as possible for the full-time position of:\nTechnical Support Engineer (m/f/d)\nThe Role\nInteract directly with customers and prospective buyers by responding to technical questions\nRespond to escalated technical issues via e-mail or phone\nTake over classification, analysis and troubleshooting of inquiries\nAssist with accurate technical documentation\nInteract with internal escalation resources (in Germany) to resolve complex tech issues\nYou would be the best fit for us if\nYou have a passion for customer support\nYou have 2-4 years of experience in the IT Technical Support field\nProven understanding of client-server application architecture and MS Windows based knowledge\nYou have proven structured problem solving skills\nExcellent written and verbal communication skills\nWhat you can expect from us\nWe offer a varied and challenging role characterized by independence and freedom. You will receive support from our headquarters in Augsburg, Germany.\nSeize your opportunity and send us your application by e-mail to jobs@baramundi.de, stating a possible starting date and your salary expectations.\n\nWe are looking forward to hearing from you!\n\nYour contact:\nFrau Ramona Petrasch\nPhone: +49 (821) 5 67 08 - 633\n\nbaramundi software AG\nBeim Glaspalast 1\n86153 Augsburg\nwww.baramundi.de\nwww.baramundi.de/karriere"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0AVKLlbEkauwKsD17hdtxxIbnLa1Bh8fW274UzALlWLiESOMUfCO4J6_C4YN5qbxSwhHi9jkYoOqKAcJOerHm41Qyip-iP-Vus40ig7jK-vKJlT73ngKwPXyiDRjFNTzKu5FEhtCU2FtqoP64P6sG6OxyamLAWsCyz_zhtTNzOJ5Jg6Di7rPs0R0lGD0jsv7g02A2jl3tz7vnweZirZVQEZwgGURvcnmHrJkTax9ulUIAYXaCaBbAtvteEy5zCUW5-UVHmfPJqUAN6U1nPu2PCH_9_ipk3Du4JsqNAJ4Tq5gOCkHfC8iTGcqrIaqsLKoNdBblDTVjTwiFlhdFEQFxj6IGc42jZWpe7iulirji3_rt1SytI7NW1prbK1quDQ1iWfptTv_3xY7jLjXS2c11IYy0RWs-XRmpDmCdMUyIl8tRLJfMa_EflxMkOlA1K-u4XjkImQodL8S17vIl6IRI_lb9vAb2cJ-PA2yCnQ4p6b898v-fnHFw7b&vjs=3&p=1&sk=&fvj=0", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Homesite Insurance", "job_posting_desc": "Homesite Insurance was founded in 1997 and was one of the first companies to enable customers to purchase home insurance directly online, during a single visit. Since then, we've continued to innovate rapidly to meet the needs of our customers and their changing expectations.\nOne thing that's stayed the same since our founding: our commitment to our customers, partners and employees.\nJoin us on our journey as we continue to grow into a powerful contender in the field of insurance.\nHomesite is always seeking new Software Engineers to work closely with various IT Teams, with a focus on supporting services, supporting business logic for our front end applications and supporting internal systems. As a member of IT Development Team, this person will primarily be designing and developing services that support our ecosystem of homeowner’s products. The ideal candidate has a strong programming experience and has worked with modern technology stack including micro-services architecture and test-driven development methodologies in a fast-paced agile environment.\nDUTIES AND RESPONSIBILITIES:\n\nSupport and update existing internal applications and services.\nCollaborate in our Agile/Scrum software development process.\nWork with product stakeholders to establish software requirements.\nWork with platform & system architects on software and system optimizations & enhancements to create elegant designs.\nWork with other software leads on developing and improving software development methodologies and processes.\nFocus on design patterns, test driven development, enforce code quality and standards, and document APIs.\nLead & guide the fellow developers on the team through technical skill development and knowledge sharing.\nAlign technical solutions with business and IT strategic visions while complying with the organization's architectural standards.\nCollaborate with Project Managers, business and technical analysts, developers, QA, and other IT team members to understand business & technical requirements that drive the analysis, design, and creation of quality technical solutions.\n\nKNOWLEDGE, SKILLS AND COMPETENCIES:\n\nA firm knowledge of Java and related tools such as Spring Framework, Spring Boot, Maven\nA firm knowledge of C# and .Net Framework.\nHands on experience using and developing REST APIs using micro services architecture\nWorking knowledge of distributed enterprise architecture.\nStrong understanding of Git, Bitbucket, Jira, Confluence, Swagger (API documentation).\nWorking knowledge of relational databases such as MS SQL Server, MySQL and Aurora\nWorking knowledge of Agile / Scrum methodology.\nAbility to visualize, articulate, and solve problems to make informed decisions as well as organize and analyze a solution as part of a whole and its individual components.\nAbility to communicate effectively in written and oral communications.\nRespond well to change; handle multiple demands / priorities effectively; adapt to best fit with situation at hand; handle conflict effectively; willing to accept new responsibilities; take initiative and be accountable.\n\nEDUCATIONAL QUALIFICATIONS/JOB EXPERIENCE REQUIREMENTS:\n\nBachelor’s degree in Computer Science, Computer Engineering, Information Technology/Systems, related field, or equivalent experience.\n4 + years of relevant experience around design and development of distributed enterprise applications.\n\nOTHER JOB EXPERIENCES DESIRED:\n\nInsurance industry experience a plus, but not required.\nExperience with cloud computing APIs (Amazon Web Services preferred).\nExperience with cloud computing services (Amazon Web Services like Lambda, S3, CloudWatch, ECS, and RDS preferred)\nInterest in emerging platform-as-a-service / distributed application frameworks such as ECS, Spring, ElasticBeanstalk and Docker.\nPrior experience of Microsoft Stack of technologies.\nApply to: careers@homesite.com"},
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=98b35c881dbc0495&fccid=053c0caee91baa24&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Jr. Data Engineer, 40hpw, BWH Cardiovascular Innovation", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Brigham & Women's Hospital(BWH)", "job_posting_desc": "One Brave Idea (OBI) is a unique $75 million investment focused on combating coronary heart disease, enabled by a collaboration between the American Heart Association, Verily (formerly Google Life Sciences), and AstraZeneca with additional support from Quest Diagnostics. OBI has assembled a diverse team of scientists, together with the latest technologies and scientific advances, to identify the weapons and strategies needed to win the fight against cardiovascular disease, the leading cause of death worldwide. Based in the Science Innovation Center in the Longwood Medical Area in Boston, the OBI team combines innovative participant phenotyping, large scale genetic, genomic and proteomic characterization, and mechanistic cell biology to enable novel discoveries and drive their application to clinical practice.\n\n\nOBI is currently seeking a full-time Data Engineer who’s excited to roll up their sleeves and join a multidisciplinary team focused on developing an individualized patient trajectory database that will enable development of artificial intelligence models for clinical care and research. The candidate will be expected to tackle multiple aspects of data engineering, ETL, software development, analytics, and traditional DevOps roles in a fast-paced and highly cross-functional role.\n\n\nThe candidate will join a team focused on architecting and implementing a secure cloud-hosted database for imaging and clinical data with the overarching goal of modeling individual patient trajectories. They will work closely with data scientists who are actively developing artificial intelligence models from this data, and ensure the data is present in a meaningful way for enabling training and validation of robust models. The position will also involve interacting with IT professionals and academic collaborators at other institutions to facilitate client-side deidentification and uploading of data. It will also entail working with HL7 and other protocols for accepting data. Data from the archive will be used for building machine learning models for disease detection and risk assessment.\n\n\nThe candidate may also play a broader role in other data focused efforts at OBI. As part of the role, there will be heavy emphasis on documentation as appropriate and some need for troubleshooting, diagnosing, developing monitoring solutions, performing SQL queries, updating, tracking and resolving technical challenges, as well as building and developing tools which will automate daily operational activities.\nQualifications\n\nQUALIFICATIONS:\n\n\nRequired:\n B.S. in Computer Science, Information Systems, or a related field.\n Good knowledge of SQL and databases.\n Strong understanding of data modeling & ETL principles\n Development experience in Java/Python/R.\n Excellent written and oral English communication skills to successfully engage with colleagues.\n\nPreferred:\n Experience with graph databases.\n At least 1 year of experience collaborating with Data Science/Engineering teams.\n Experience with agile software development practices such as scrum or Kanban.\n Proven ability to troubleshoot and identify the root cause of issues.\n Demonstrates skill and passion for operational excellence.\n\n\nSKILLS/ ABILITIES/ COMPETENCIES REQUIRED:\n\n Ability and motivation to be self-directed, logically and effectively structure tasks, and establish priorities.\n Ability to interact proactively with a small group.\n Ability to communicate verbally and in writing with technical and non-technical personnel.\n\n\nPrimary Location: MA-Boston-Boston - BWH Main Campus\nWork Locations: Boston - BWH Main Campus 75 Francis St Boston 02115\nJob: Business and Systems Analyst\nOrganization: Brigham & Women's Hospital(BWH)\nSchedule: Full-time\nStandard Hours: 40\nShift: Day Job\nEmployee Status: Regular\nRecruiting Department: BWH Department Of Medicine / Cardiovascular Medicine\nJob Posting: Mar 13, 2019"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0B_ic_lyYdB92l-47iK7M2O-Cx2i-GLy_ImdN3yuA5nHl2bZBpVCXodzvOkFPjPeIVJvMVSN6zny-qew7e1h27gFuw96OKaao2WeFLeqBqQf7sin9xrlHnwpC6UfceqvjP0Whr-hkPr80mYaEJesah4ZPRyK2CbII9shspTYogGo8NoNB4zu9E94IVY0z8dsgm0TXfoP-npBLiY5jYKUJ18vnQBzvzh3oTw5FH2hXO6QVeg-Lwjt8U_tCX9UV_qf52KGFw1avSILzaQmuqv6a-URfZXL7PpNkiTpFHEnjOGz5Z_hxjqvXobjIgOHj2hN8yHO5gb1GRR5t0v7iT3KV5Ya6x7tDkYu_x7akhj_7Dnh3HdMu7kQcWWjUiczTJdwixbM5D40jKpkWDYhjtBRjISb9Hbs7IuBB05es7Y3d9ACyBj3Et4A9escqcpDK-W9839ayP-SWHSV-1kOowqM2bRPsOsim1J4tenmkBtAApMhkYmQM4EHfAi2XQhpXktzK3f8GqIysxdIPYXYH-QIdxNgdkUNkhN0iOeQXmSUH3Vucx2d_mk0d6I&vjs=3&p=8&sk=&fvj=0", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Philips", "job_posting_desc": "Job Title\nSoftware Engineer\nJob Description\nIn this role, you have the opportunity to\n\nWork with the HealthSuite Digital Platform Support Operations team who is currently seeking a talented web tools back-end developer. You will get experience with developing for multiple customer channels, as well as various tools and applications on a common cloud platform. This includes management, design, implementation and advocacy of the revenue cycle management system. The successful candidate must have extensive experience in Python and Web development, integrate with backend systems and new digital product offerings, and lead and set coding standards/ development tools/test tools for future development of HSDP-enabled products.\n\nYou are responsible for\n\nWork on a variety of projects as a part of a scrum team building web-based applications, database-backed websites and apps\nParticipate in architecture design processes to meet end user requirements.\nReview, analyze and modify systems, including documenting, designing, developing, testing, troubleshooting, repairing, monitoring, and maintaining.\nInstall or customize modules and features for open source and proprietary software packages.\nAssess new standards, technologies and trends, and formulate strategies and plans for future service tools and products.\nParticipate in review and staff meetings.\nYou are a part of\n\nHealthSuite Digital Platform Support Operations team. The group is a small, agile based, empowered team that is responsible for the support of tools and products that support multiple business solutions. Team oriented environment.\n\nTo succeed in this role, you should have the following skills and experience\n\nPython, Microservices, PHP, MySQL or other DBMS, MVC, UI, B2C Web Development, HTML, AJAX, JSON, UNIX\nPrior experience with cloud architecture preferred\nCS Degree highly preferred\nExperience with build management tools a plus\nAbility to work independently and as a member of a team\nStrong interpersonal and communication skills, including the ability to work effectively with diverse groups\nRelentless desire to learn and teach while adapting to evolving expectations and requirements\nKnowledge and understanding of current authoring languages and standards, editing and authoring tools, and related website technologies\nUS work authorization is a precondition of employment. The company will not consider candidates who require sponsorship for a work-authorized visa.\nCompany relocation benefits will not be provided for this position. Candidates need to live within the territory or within commuting distance to this location.\nIn return, we offer you\n\nSharpen your talents with new challenges in our dynamic organization. As a market-driven company, we’re used to listening to our customers & apply the same thinking to our employees. We offer a competitive salary, outstanding benefits and flexibility in a career with a positive and supportive atmosphere in which to develop your talents further.\n\nWhy should you join Philips?\n\nWorking at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.\n\nTo find out more about what it’s like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog. Once there, you can also learn about our recruitment process, or find answers to some of the frequently asked questions.\n\nPhilips is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex (including pregnancy), sexual orientation, gender identity, national origin, genetic information, creed, citizenship, disability, protected veteran or marital status.\n\nAs an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.\n\nContact\nIf you forgot your password, you can click the Forgot Password button on the Sign In screen to reset it. In case of technical difficulties, please send an email to careersite@philips.com.\n(Note: To ensure fairness and legal compliance in our recruitment processes, only technical issues will be monitored through the above inbox. Please do not submit resumes or applications to this email, as they will not be reviewed. Only applications received through the online application process will be considered.)"},
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=96e51ce1f8ef12f1&fccid=8b4eef541e37f57f&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Entry level Software Developer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "root liquids", "job_posting_desc": "We are looking for a Entry level software engineer to collaborate with development, Utilizes a highly collaborative feature team development model that will require deep involvement on all engineering projects for the full life cycle of development, Looking for a candidate who is passionate about efficiently delivering high quality software solutions.\n\nResponsibilities:\n\nWork with the development team and meet project delivery dates by developing, publishing, and monitoring project schedules and timelines\nActively work with the architect and other developers to design and implement product features\nTake an active role in process improvements in such areas as code review and unit testing\nHelp ensure that testable builds are delivered to the test team daily\nAssist in supervising maintenance activities and ensure escalated support issues are addressed\n\nRequirements:\n\nBachelors or Master’s Degree in Computer Science, Computer Engineering, Computer Information Systems, , Information Technology or related technical program.\nFamiliarity with Linux\nFamiliarity with one or more scripting languages\nEnthusiastic and passionate candidates looking for a startup feel\nAbility to perform root-cause analysis of failures from system logs, environment logs, test collateral.\n\n"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Aousd15sYXrhf4YXk14MwJxuY1ivfOO-TlskXG7y3ogRK1E6a0YYveDFqA4Gcx3kbXiov8EOs5yFXrzjZ7d0TOx-cDH4tipYTC_PiyVVjNL305DFGEipvZ_h4I4X0XN3hWn_RDN1DKif2TWZDNtV9V2mdI0o_wxrz-Y41V4q2wHTFkBUzbmmw1T7omC1ldgquKO4iL6uFDctRPo4RQom7r0rkfSfxDEhTp9TDtQsb3unIy8UZUxXZ0bfDdvC6Fz1pScjOge89E4OT71DwByUmVSd1UTkKeGMsqpTo-Qw0Qt11-dbMymXa0cUYUaCLbQSGOdRJEPUdr-IMa7dXDerTaHVE_iKZJXwwKlhtGzFhA6im0czL8j9ek2LP-tr_-dQWuy4twFxfor0_PES7WkN2DT0oXX17qq3DVKOGKo6oY_iOmzoseQ1CNlfike50iUpqk9RuLZ0eDswjjDta1NSV4&vjs=3&p=9&sk=&fvj=1", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Configuration Management Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "RL Controls, LLC", "job_posting_desc": "Job Description:  Configuration Management EngineerCompany: RL Controls, LLCLocation: Boston, MAEducation: Bachelor’s degree in a Technical FieldJob type: Full-timeResponsibilities: -Perform Configuration Management related functionsPlanningConfiguration IdentificationStatus AccountingConfiguration ControlAudits-Develop project specific Configuration Management Plans taking into account industry standards, ASTS processes and the project contract-Ensure the implementation of project specific Configuration Management Plans-Perform Physical Configuration Audits, facilitate root cause analysis and corrective and preventive action implementation-Report information needed for configuration management such as the status of configuration items (CIs), proposed changes and the implementation status of approved changes-Provide Teamcenter and DOORS support as requiredSkills and Knowledge: -Bachelor’s Degree in technical related field-Highly motivated with excellent problem solving and documentation skills and the ability to work independently-Prior experience conducting Quality or Configuration Management Audit a plus-Prior experience in a software development environment a plus-Experience with CMMI a plus-Strong working knowledge or experience with Teamcenter (or another PDM system), DOORS and Rational Team Concert a plusPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.LOCAL CANDIDATES ONLY.RLC is an EEO Employer and will offer a competitive salary with benefits including health-dental-vision-life insurance, personal time-off, holidays, 401(k) to qualified candidate.Job Type: Full-timeExperience:Teamcenter: 3 years (Required)conducting Quality or Configuration Management Audit: 2 years (Preferred)Education:Bachelor's (Required)Location:Boston, MA (Preferred)Language:English (Required)Work authorization:United States (Required)Benefits offered:Paid time offHealth insuranceDental insuranceOther types of insuranceRetirement benefits or accounts"},
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=9681b67d2977bb64&fccid=2e7c6e6217aa02b5&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "SOFTWARE ENGINEER, Hariri Institute", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Boston University", "job_posting_desc": "Work as part of a Massachusetts Open Cloud (MOC) agile team developing and operating OpenStack cloud software and infrastructure to support the mission of the Red Hat Collaboratory and the larger Hariri Institute. Work focuses on developing OpenStack software. Work also involves participation and is in support of multiple projects. See info.massopencloud.org for more details. Mentor a community of students, interact/contribute with a number of OpenStack and Open source communities as well as MOC industry and academia partners alike.\n\nRequired Skills\nBachelors degree in a computer science or computer engineering field and 1-3 years related experience.\n\nWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. We are a VEVRAA Federal Contractor.\n\nRequired Experience"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Aousd15sYXrhf4YXk14MwJxuY1ivfOO-TlskXG7y3ogRK1E6a0YYveDFqA4Gcx3kbXiov8EOs5yFXrzjZ7d0TOx-cDH4tipYTC_PiyVVjNL305DFGEipvZ_h4I4X0XN3hWn_RDN1DKif2TWZDNtV9V2mdI0o_wxrz-Y41V4q2wHTFkBUzbmmw1T7omC1ldgquKO4iL6uFDctRPo4RQom7r0rkfSfxDEhTp9TDtQsb3unIy8UZUxXZ0bfDdvC6Fz1pScjOge89E4OT71DwByUmVSd1UTkKeGMsqpTo-Qw0Qt11-dbMymXa0cUYUaCLbQSGOdRJEPUdr-IMa7dXDerTaHVE_iKZJXwwKlhtGzFhA6im0czL8j9ek2LP-tr_-dQWuy4twFxfor0_PES7WkN2DT0oXX17qq3DVKOGKo6oY_iOmzoseQ1CNlfike50iUpqk9RuLZ0eDswjjDta1NSV4&vjs=3&p=9&sk=&fvj=1", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Configuration Management Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "RL Controls, LLC", "job_posting_desc": "Job Description:  Configuration Management EngineerCompany: RL Controls, LLCLocation: Boston, MAEducation: Bachelor’s degree in a Technical FieldJob type: Full-timeResponsibilities: -Perform Configuration Management related functionsPlanningConfiguration IdentificationStatus AccountingConfiguration ControlAudits-Develop project specific Configuration Management Plans taking into account industry standards, ASTS processes and the project contract-Ensure the implementation of project specific Configuration Management Plans-Perform Physical Configuration Audits, facilitate root cause analysis and corrective and preventive action implementation-Report information needed for configuration management such as the status of configuration items (CIs), proposed changes and the implementation status of approved changes-Provide Teamcenter and DOORS support as requiredSkills and Knowledge: -Bachelor’s Degree in technical related field-Highly motivated with excellent problem solving and documentation skills and the ability to work independently-Prior experience conducting Quality or Configuration Management Audit a plus-Prior experience in a software development environment a plus-Experience with CMMI a plus-Strong working knowledge or experience with Teamcenter (or another PDM system), DOORS and Rational Team Concert a plusPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.LOCAL CANDIDATES ONLY.RLC is an EEO Employer and will offer a competitive salary with benefits including health-dental-vision-life insurance, personal time-off, holidays, 401(k) to qualified candidate.Job Type: Full-timeExperience:Teamcenter: 3 years (Required)conducting Quality or Configuration Management Audit: 2 years (Preferred)Education:Bachelor's (Required)Location:Boston, MA (Preferred)Language:English (Required)Work authorization:United States (Required)Benefits offered:Paid time offHealth insuranceDental insuranceOther types of insuranceRetirement benefits or accounts"},
{"job_posting_url": "https://www.indeed.com/rc/clk?jk=4ff6d3772712fe8f&fccid=a5b4499d9e91a5c6&vjs=3", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Google", "job_posting_desc": "Minimum qualifications:\nBS degree in Computer Science, similar technical field of study or equivalent practical experience.\n\n1 year of relevant work experience in software development.\n\nExperience working with two or more from the following: web application development, Unix/Linux environments, mobile application development, distributed and parallel systems, machine learning, information retrieval, natural language processing, networking, developing large software systems, and/or security software development.\n\nExperience with one or more general purpose programming languages including but not limited to: Java, C/C++ or Python.\n\nPreferred qualifications:\nMS or PhD degree in engineering, computer science, or other technical related field; or equivalent practical experience\n\nInterest and ability to learn other coding languages as needed.\nAbout the job\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nGoogle aspires to be an organization that reflects the globally diverse audience that our products and technology serve. We believe that in addition to hiring the best talent, a diversity of perspectives, ideas and cultures leads to the creation of better products and services.\nGoogle is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another. Responsibilities\n\nDesign, develop, test, deploy, maintain and improve software.\n\nManage individual project priorities, deadlines and deliverables.\nAt Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing this form ."},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D4CCI6NNsDXxT6UkWgE1mBPhnzs0fYXDbFunDf5KU2kSiFBYKKdFoFrOWUArrKJydkjyXFzfxjhSucLOsH6XotluFfp6-u9xriWgPOu0HROafagW0CkRxnkdI4pZRDZUYd8DyM6Als0t7QxsdDTT9NYztZVtp7IefylKqtSO_rdvVqfBCnhKEVtgA8bacDZvRI5jnXnRPk2Ye9ZthFqaub2TiwqEPQPDJX_07QqUpUJWD1RZBv3NIxkeweElFFPk-JuebZjlbbZwyFIroSCGAAq5PfE_og_P9fdXBrSNOTI2uBqseCK99yaCrQkaUsq5j2v055sinqjpaRId4RSfxL8QOI_mfmuNDl0jf05bRpqNZoMiAx_lOrjblJwCkbic_1KbmKtUTpBt0C_jgfSpMGZ34NPwGC6O1VXc91LnJm2QSf2NGoXmnR0KGXdtnEnKw7t-HPgKedG93DhvuhHO3l&vjs=3&p=8&sk=&fvj=0", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Technical Support Engineer (m/f/d)", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "baramundi software AG", "job_posting_desc": "Shape your future with us!\nAs the publisher of the “baramundi Management Suite” product, baramundi software AG, based in Augsburg, Germany, is a leading provider of endpoint management software. Innovative product development and a comprehensive range of services is what sets us apart. Due to our rapid and continual growth, in 2017 we established a subsidiary in Boston Framingham USA.\nIf you are interested in new, challenging opportunities, being part of a qualified team and working in a dynamic and professional environment, we’d like to talk to you. For our subsidiary in the USA, we are looking for an outstanding individual to start as soon as possible for the full-time position of:\nTechnical Support Engineer (m/f/d)\nThe Role\nInteract directly with customers and prospective buyers by responding to technical questions\nRespond to escalated technical issues via e-mail or phone\nTake over classification, analysis and troubleshooting of inquiries\nAssist with accurate technical documentation\nInteract with internal escalation resources (in Germany) to resolve complex tech issues\nYou would be the best fit for us if\nYou have a passion for customer support\nYou have 2-4 years of experience in the IT Technical Support field\nProven understanding of client-server application architecture and MS Windows based knowledge\nYou have proven structured problem solving skills\nExcellent written and verbal communication skills\nWhat you can expect from us\nWe offer a varied and challenging role characterized by independence and freedom. You will receive support from our headquarters in Augsburg, Germany.\nSeize your opportunity and send us your application by e-mail to jobs@baramundi.de, stating a possible starting date and your salary expectations.\n\nWe are looking forward to hearing from you!\n\nYour contact:\nFrau Ramona Petrasch\nPhone: +49 (821) 5 67 08 - 633\n\nbaramundi software AG\nBeim Glaspalast 1\n86153 Augsburg\nwww.baramundi.de\nwww.baramundi.de/karriere"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DZ1g6n_H6csNU-HKCOI29FX6QjV-7zy9uuWEWtn46AaJJOm4HjldkZpHsMAS6QMQU08uKwHOGJfWA8KzEvcu0m0M7U2Pm6eHH4zUhzJJ8YLorS5uTJqyumwO0TJtFmFfKkoOaYcwZFiylAM04U3ORNSxt_RxtZP9zQveNdu1mnIj3qO-8eK7_3hxErbL8yev_onTIeJWYBY4ok8Btt5GulfAn06I8bvBXwjnu8MXkKRkz9_-xiThvHkvYzkdF6xssm0j7jI2sowvhB_p1yqnkpEbLAqI9XBDnAqul7JFrjMEsw7vRCDleKdoWaPIgk8CSb5PKvH1vigwsXOOV-vXAGaEyL-8Kcj9yQmKaMDl9S8MCCRhvq6mgFa0WNKbv64TP7nnIVivKgqTtJwuUFMLhx7XvE7X9YsWzsumha76dmjzLPyOAB6MHxml2OTfVwU1h60U8tFs4eEhxa6eUWo4rz&vjs=3&p=7&sk=&fvj=1", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software and Database Specialist", "job_posting_salary": "$80,000 - $85,000 a year", "scrap_date": "28-03-2019", "company": "Transdev", "job_posting_desc": "$80,000 - $85,000 a yearThe Software & Database Specialist will work with the Operations Director and scheduling and dispatching staff to fine-tune and customize the system software (Routematch or other designated Dispatch & Scheduling software) to ensure maximum effectiveness. The Software & Database Specialist will report to the Service Analysis & Planning Manager.ResponsibilitiesGathering, analyzing, cleaning and maintaining data to predict future run/trip volumes and patterns.Gathering and maintaining a chart listing data irregularities (holidays, storms, etc...) that impact run/trip volume to accurately reflect future demand.Working with the software supplier (Routematch or other) to ensure that all system parameter settings are appropriate.Analyzing and customizing system settings to maximize performance, including configuration of operating zones, vehicle zone affinity settings, travel time parameters, and speed settings.Perform regular reviews of all service provider/operator profiles to confirm that operator parameters are current and have not been altered.Running reports on system performance, such as productivity by route, deadhead by route, etc. to inform decisions about system fine-tuning and customization.Periodically reviewing the master schedule of runs and matching it to demand using available tools.Periodically evaluating scheduling parameters (system speeds, dwell time settings, etc.) and recommending modificationsWorking with operations staff and service providers to assess and fine-tune run structures, conducting test runs in the test environment server to allow possible system changes to be tested before being implemented.Creating special queries and ad hoc reports that assist schedulers and dispatchers with the performance of their duties.Logging and distributing changes and customizations as they are created and implemented to Routematch or equivalent scheduling/dispatch software.QualificationsEducation, Licensing, and Certifications Preferred: Bachelor’s Degree in Computer Science or closely related field or equivalent experience and additional computer training and certifications are a plus.Experience, Skills, and Knowledge Required: Strong working knowledge of the Routematch system (or other designated Dispatch & Scheduling software), including its functionalities, structure, and settings preferred.Strong working knowledge of SQL or other big data software/tool.Problem-solving skills and the ability to work independently.Pre-Employment Requirements: Must submit to drug testing and a background check.P*hysical Requirements: *Must be able to work shifts or flexible work schedules as needed.90% of work is accomplished indoors and in air-conditioned or well-ventilated facilities.Work is accomplished in an office or in a cubicle space equipped with a telephone and computer.The employee is generally subjected to long periods spent sitting, typing, or looking at a computer screen.For more information please visit our website at www.transdevna.com/careersJob Type: Full-timeSalary: $80,000.00 to $85,000.00 /yearExperience:Transit/Transit Software: 2 years (Required)Education:Bachelor's (Required)Work authorization:United States (Required)"},
{"job_posting_url": "https://www.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CgsfMtVtRReqlY5EjWEH3NGae5gzjDwBE_fdOSrakDuR_BBN0wKfXwRyEEDEB5osVDbHpiWXO277RX2uLFrw10JtRbkI1yMNR7jMxBvPt_g8Wf85KTmmaTvC_qWsh4PQ-A2Ozn3OLZO7ZjRF_SUJFNRfiJz45OrFgIo4OTKGVX1kYXj7_MGOcdJoPql8s8Y7B3En-LAE358Ism-pjtIkV3Z4ID1hqRi6xsQyILhGKbFE_JAJmfBk5PtMsl6ddeoZuzaN7C5DQBKST96sbFqdKEEvSJE84ZqXsjnvd4YAjSFprmbHW8WrWGuxRJZ2VRHrHmN62kvNZzLqvXL49w74BFUvGzhpr3GSemEeWJFx7CsNYOr-pt17CpGMLHYlpZyjabzGgkROa6tnwRruxtoFlZQLQUlXo-ovzPpFZzbn26FOzhqHlzKnyvY5FyPZnB7mc=&vjs=3&p=8&sk=&fvj=0", "job_title": "Software Engineer", "location": "Boston", "job_posting_title": "Software Support Engineer", "job_posting_salary": null, "scrap_date": "28-03-2019", "company": "Snowbound Software Corporation", "job_posting_desc": "We take support very seriously at Snowbound so we are looking for someone who is comfortable with Support as a career. We are not looking for someone who will just answer phones and read from a script. We want someone who will commit to providing our customers with top notch, customized support.\n\nThis Support person will be responsible for responding to support requests for Snowbound’s viewing and imaging software products.\n\nThis involves:\nProviding professional responses to the customer through our ticketing system.\nReproducing issues in our VirtualViewer® and RasterMaster® SDK products. This requires skills in:\nInstalling and configuring multiple versions of multiple products on Windows and UNIX.\nUnderstanding basic differences between many document formats, including pdf, doc, docx, tif, jpeg and others.\nReading between the lines to reproduce behavior when the customer has not provided all the information needed.\nCustomizing web application configurations in XML, CSS, and HTML.\nProgramming in Java or C#.\nKeeping concise updates of support issue progress in our ticketing and bug tracking system.\nPrioritizing incoming requests based on severity of the issue and the level of support the customer is entitled to.\nBeing organized with attention to detail to ensure the correct products and options are delivered to the correct people.\nFluency in English is required. A Bachelor’s degree in a technical field is a plus.\n\n\nIn order to fit into the Snowbound culture the person must have a positive can-do attitude, must work well in a team, and be a self-starter with a good understanding of priorities.\n\n\nWe strive to make every position at Snowbound Software rewarding and fulfilling. You will have the opportunity to grow your knowledge, capabilities, and responsibilities in a variety of directions. Compensation is commensurate with experience.\n\n\nBenefits:\nVacation Days – 3 weeks accrued in first year + bonus time on anniversary\nSick/Personal Days – 2 weeks per year + 3 floating holidays\n401k plan\nHealth, Dental, Vision, Life, and Disability insurance\nEducation and training reimbursement\nDiscretionary profit share/bonus plan"}